'''

정리 ! 지금까지 한 일

1. 버추얼 박스 : 가상 운영체제 올리기 위한 프로그램, 예를 들면 리눅스(Linux)(Ubuntu), 윈도우,

2. Vagrant : 버추얼 박스 쉽게 이미지 올리는 명령어

3. ssh : colsole 원격 접속 (서버에 접속하는 방법)

-> IP 주소, port 호수. 하나의 서버 안에 여러가지 프ㅗㄹ그램이 있는데 포트를 배정받아서

서버=엄청나게 좋은 컴퓨터. 메모리 있고 cpu있고... 모든 컴퓨터가 서버로서 작용할 수 있다.
리눅스나 윈도우가 서버역할 가능.

https://www.naver.com:443
왼쪽이 도메인네임(사실 IP) 오른쪽에 443 이게 포트.



172.16.12.101 이라는 IP 에 3306 포트를 꽂아서 접속한 것.
서버에 접속해서 데이터를 받아온 것.
컴퓨터 끼리의 통신이 바로 서버.
내 컴퓨터도 서버가 될 수 있음.

라우터(공유기)에서 IP를 할당받을 수 있다.
adapter :

리눅스 서버 mysql에 저장되어있는 거를 가지고 온거임


'''